app/views/users/index.html.erb


            <% user.team_members.each do |team_member| %>
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."user_id" = ?  [["user_id", 1]]