app/views/app/main.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  var users = new Backbone.Collection;
  users.reset(<%= @users = User.find(params[:id] = 1).to_json %>);