app/controllers/projects_controller.rb

  def get_projects
      @user = User.find(params[:id])

      @proj = []
      @projects = @user.team_members.each do |team_member|
       if team_member.role != 'null'
          @proj_id = team_member.team.project_id
          @project = Project.find(params[:id] = @proj_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "team_members".* FROM "team_members" WHERE "team_members"."user_id" = ?  [["user_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? ORDER BY "teams"."id" ASC LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]