app/controllers/stories_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "undefined"]]
SELECT "stories".* FROM "stories" WHERE "stories"."project_id" = ? AND (status='Product')  [["project_id", 1]]
---
  def index
    #@stories = Story.all
	@stories =  Project.find(params[:id]).stories.all(:conditions => ["status='Product'"])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_story
      @story = Story.find(params[:id])