app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "stories".* FROM "stories" WHERE "stories"."project_id" = ?  [["project_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."story_id" = ?  [["story_id", 1]]
---
   def get_tasks
    @project = Project.find(params[:id])

      @array_of_tasks = []

      @story = @project.stories.each do |storyitem|

        if storyitem.status == 'Sprint'
          storyitem.tasks.each do |taskitem|